src/cf/Documents/GDS_АктПриемаПередачиТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>GDS_АктПриемаПередачиТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.GDS_ЭлементыПроверки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОсмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сдал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принял</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсмотрПровел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Одометр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеКСостояниюПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платон</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдометрТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдометрПрицеп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдометрПрицепТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегПрицеп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокТопливаПрицеп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматированноеОписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПринял</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПрицеп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлементыПроверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.GDS_ПунктыПроверкиТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.GDS_СостоянияПроверкиАПП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПроблем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Замечания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтветственныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/GDS_ДокументыАПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ДокументыАПП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.GDS_АктПриемаПередачиТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/GDS_ФайлыАПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ФайлыАПП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДвоичныеДанныеФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/GDS_АктПриемаПередачиТС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.GDS_АктПриемаПередачиТС";
	КомандаПечати.Идентификатор = "GDS_АктПриемаПередачиТС";
	КомандаПечати.Представление = НСтр("en='Report';ru='Акт приема передачи'");

КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если НЕ уатОбщегоНазначенияСервер.РазрешениеПечатиНепроведенногоДокумента(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "GDS_АктПриемаПередачиТС") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "GDS_АктПриемаПередачиТС",
			"Акт приема-передачи ТС", ПечатьАктПриемаПередачиТС(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	уатОбщегоНазначенияСервер.УстановитьРедактированиеПечатныхФормДокумента(КоллекцияПечатныхФорм);
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Формирует таблицу значений, содержащую данные для проведения по регистру КузовныеЭлементы.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуЭлементыПроверки(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт

	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	GDS_АктПриемаПередачиТСЭлементыПроверки.Ссылка.ДатаОсмотра КАК Период,
	|	GDS_АктПриемаПередачиТСЭлементыПроверки.Ссылка КАК Регистратор,
	|	GDS_АктПриемаПередачиТСЭлементыПроверки.ТС КАК ТС,
	|	GDS_АктПриемаПередачиТСЭлементыПроверки.ЭлементПроверки КАК ЭлементПроверки,
	|	GDS_АктПриемаПередачиТСЭлементыПроверки.НаличиеПроблем КАК НаличиеПроблем,
	|	GDS_АктПриемаПередачиТСЭлементыПроверки.Замечания КАК Замечания,
	|	GDS_АктПриемаПередачиТСЭлементыПроверки.Состояние КАК Состояние
	|ИЗ
	|	Документ.GDS_АктПриемаПередачиТС.ЭлементыПроверки КАК GDS_АктПриемаПередачиТСЭлементыПроверки
	|ГДЕ
	|	GDS_АктПриемаПередачиТСЭлементыПроверки.Ссылка = &Ссылка";
	тблЭлементыПроверкиТС = мЗапрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЭлементыПроверкиТС", тблЭлементыПроверкиТС);
	
КонецПроцедуры

Функция ТСиПрицепыДокумента(ДокументСсылка) Экспорт
	мсвТС = Новый Массив;
	Если ЗначениеЗаполнено(ДокументСсылка.ТС) Тогда
		мсвТС.Добавить(ДокументСсылка.ТС);
	КонецЕсли;
	
	//Пока один прицеп ,но нужно переделать на два прицепа Прицеп1 и Прицеп2
	Если ЗначениеЗаполнено(ДокументСсылка.Прицеп) Тогда
		мсвТС.Добавить(ДокументСсылка.Прицеп);
	КонецЕсли;
	//Если ЗначениеЗаполнено(ДокументСсылка.Прицеп2) Тогда
	//	мсвТС.Добавить(ДокументСсылка.Прицеп2);
	//КонецЕсли;
	
	Возврат мсвТС;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьАктПриемаПередачиТС(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_GDS_АктПриемаПередачиТС";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_GDS_АктПриемаПередачиТС";
		Макет = Документы.GDS_АктПриемаПередачиТС.ПолучитьМакет("GDS_КарточкаЧекЛиста");
		
		РезультатЗапроса = РезультатЗапросаДанныеДокумента(ТекущийДокумент);
		Выборка = РезультатЗапроса.Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапкаТС = Макет.ПолучитьОбласть("ШапкаТС");
		ОбластьШапкаПрицеп = Макет.ПолучитьОбласть("ШапкаПрицеп");
		ОбластьШапкаНеисправность = Макет.ПолучитьОбласть("ШапкаНеисправность");
		ОбластьСтрокаНеисправность = Макет.ПолучитьОбласть("СтрокаНеисправность");
		ОбластьПодвалТС = Макет.ПолучитьОбласть("ПодвалТС");
		ОбластьПодвалПрицеп = Макет.ПолучитьОбласть("ПодвалПрицеп");
		
		ТабличныйДокумент.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ОбластьЗаголовок.Параметры.Заполнить(Выборка);
			
			ОбластьЗаголовок.Параметры.Принял = Выборка.СтрокаПринял;
			
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			ОбластьШапкаТС.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(ОбластьШапкаТС);
			
			ВыборкаЭлементыПроверки = Выборка.ЭлементыПроверки.Выбрать();
			Если ВыборкаЭлементыПроверки.Количество() Тогда
				ТабличныйДокумент.Вывести(ОбластьШапкаНеисправность);
				Пока ВыборкаЭлементыПроверки.Следующий() Цикл
					Если ВыборкаЭлементыПроверки.ТС <> Справочники.уатТС.ПустаяСсылка() Тогда
						ОбластьСтрокаНеисправность.Параметры.Пункт       = ВыборкаЭлементыПроверки.ЭлементПроверки;
						ОбластьСтрокаНеисправность.Параметры.Состояние   = ВыборкаЭлементыПроверки.Состояние;
						ОбластьСтрокаНеисправность.Параметры.Комментарий = ВыборкаЭлементыПроверки.Замечания;
						
						ЕстьВложение = ОпределитьФайлыПунктаПроверки(ТекущийДокумент, ВыборкаЭлементыПроверки.ЭлементПроверки);
						ОбластьСтрокаНеисправность.Параметры.Вложение = ЕстьВложение;
						
						ТабличныйДокумент.Вывести(ОбластьСтрокаНеисправность);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ШаблонКомментарийТС = СтрШаблон("Комментарий: %1", Выборка.Замечания);
			
			ОбластьПодвалТС.Параметры.Комментарий = ШаблонКомментарийТС;
			ТабличныйДокумент.Вывести(ОбластьПодвалТС);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ОбластьШапкаПрицеп.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(ОбластьШапкаПрицеп);
			
			ВыборкаЭлементыПроверки = Выборка.ЭлементыПроверки.Выбрать();
			Если ВыборкаЭлементыПроверки.Количество() Тогда
				ТабличныйДокумент.Вывести(ОбластьШапкаНеисправность);
				Пока ВыборкаЭлементыПроверки.Следующий() Цикл
					Если ВыборкаЭлементыПроверки.ТС = Справочники.уатТС.ПустаяСсылка() Тогда
						ОбластьСтрокаНеисправность.Параметры.Пункт       = ВыборкаЭлементыПроверки.ЭлементПроверки;
						ОбластьСтрокаНеисправность.Параметры.Состояние   = ВыборкаЭлементыПроверки.Состояние;
						ОбластьСтрокаНеисправность.Параметры.Комментарий = ВыборкаЭлементыПроверки.Замечания;
						
						ЕстьВложение = ОпределитьФайлыПунктаПроверки(ТекущийДокумент, ВыборкаЭлементыПроверки.ЭлементПроверки);
						ОбластьСтрокаНеисправность.Параметры.Вложение = ЕстьВложение;
						
						ТабличныйДокумент.Вывести(ОбластьСтрокаНеисправность);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ШаблонКомментарийПрицеп = СтрШаблон("Комментарий: %1", Выборка.ПримечаниеКСостояниюПрицепа);
			
			ОбластьПодвалПрицеп.Параметры.Комментарий = ШаблонКомментарийПрицеп;
			ТабличныйДокумент.Вывести(ОбластьПодвалПрицеп);
			
			
		//	ОбластьЗаголовок.Параметры.ТекстЗаголовка = ХозОперацияДляПечати(Выборка.ВидОперации) + " "
		//		+ уатОбщегоНазначенияТиповые.уатСформироватьЗаголовокДокумента(Выборка);
		//	ТабличныйДокумент.Вывести(ОбластьЗаголовок);

		//	ОбластьШапка.Параметры.Заполнить(Выборка);
		//	СведенияОбОрганизации = уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(Выборка.Организация, Выборка.Дата);
		//	ОбластьШапка.Параметры.ОрганизацияПредставление = уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(
		//		СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		//	ТабличныйДокумент.Вывести(ОбластьШапка, Выборка.Уровень());
		//	
		//	Если ЗначениеЗаполнено(Выборка.Сдал) Тогда
		//		ТекФизЛицо = ?(ТипЗнч(Выборка.Сдал) = Тип("СправочникСсылка.ФизическиеЛица"),
		//			Выборка.Сдал, Выборка.Сдал.ФизическоеЛицо);
		//		ОбластьШапкаСдал.Параметры.СдалИнформация =
		//			уатОбщегоНазначения.уатФИОСотрудникаПолноеСтрокой(ТекФизЛицо, Выборка.Дата) + "  " + 
		//			уатОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформацию(
		//			ТекФизЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица, Выборка.Дата);
		//		
		//		ТабличныйДокумент.Вывести(ОбластьШапкаСдал, Выборка.Уровень());
		//	КонецЕсли;
		//	
		//	Если ЗначениеЗаполнено(Выборка.Принял) Тогда
		//		ТекФизЛицо = ?(ТипЗнч(Выборка.Принял) = Тип("СправочникСсылка.ФизическиеЛица"),
		//			Выборка.Принял, Выборка.Принял.ФизическоеЛицо);
		//		ОбластьШапкаПринял.Параметры.ПринялИнформация =
		//			уатОбщегоНазначения.уатФИОСотрудникаПолноеСтрокой(ТекФизЛицо, Выборка.Дата) + "  " + 
		//			уатОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформацию(
		//			ТекФизЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица, Выборка.Дата);
		//		
		//		ТабличныйДокумент.Вывести(ОбластьШапкаПринял, Выборка.Уровень());
		//	КонецЕсли;
		//	
		//	Если ЗначениеЗаполнено(Выборка.ПутевойЛист1) Тогда
		//		ОбластьШапкаПутевойЛист1.Параметры.ПутевойЛист1 = Выборка.ПутевойЛист1;
		//		ТабличныйДокумент.Вывести(ОбластьШапкаПутевойЛист1, Выборка.Уровень());
		//	КонецЕсли;
		//	Если ЗначениеЗаполнено(Выборка.ПутевойЛист2) Тогда
		//		ОбластьШапкаПутевойЛист2.Параметры.ПутевойЛист2 = Выборка.ПутевойЛист2;
		//		ТабличныйДокумент.Вывести(ОбластьШапкаПутевойЛист2, Выборка.Уровень());
		//	КонецЕсли;
		//	
		//	ОбластьШапкаСостояниеСалона.Параметры.СостояниеСалонаТС = Выборка.СостояниеСалонаТС;
		//	ТабличныйДокумент.Вывести(ОбластьШапкаСостояниеСалона, Выборка.Уровень());
		//	
		//	ОбластьШапкаПримечаниеКСостояниюСалона.Параметры.Примечание = Выборка.ПримечаниеКСостояниюСалонаТС;
		//	ТабличныйДокумент.Вывести(ОбластьШапкаПримечаниеКСостояниюСалона, Выборка.Уровень());
		//				
		//	ВывестиКартинкуМакетаКузова(Выборка.ТС.Модель.МакетКузоваТС, Макет, ТабличныйДокумент);
		//	
		//	// прицепы
		//	Если ЗначениеЗаполнено(Выборка.Прицеп1) Тогда
		//		ОбластьШапкаПрицеп1 = Макет.ПолучитьОбласть("ШапкаПрицеп1");
		//		ОбластьШапкаПрицеп1.Параметры.Заполнить(Выборка);
		//		ТабличныйДокумент.Вывести(ОбластьШапкаПрицеп1, Выборка.Уровень());
		//		ВывестиКартинкуМакетаКузова(Выборка.Прицеп1.Модель.МакетКузоваТС, Макет, ТабличныйДокумент);
		//	КонецЕсли;
		//	Если ЗначениеЗаполнено(Выборка.Прицеп2) Тогда
		//		ОбластьШапкаПрицеп2 = Макет.ПолучитьОбласть("ШапкаПрицеп2");
		//		ОбластьШапкаПрицеп2.Параметры.Заполнить(Выборка);
		//		ТабличныйДокумент.Вывести(ОбластьШапкаПрицеп2, Выборка.Уровень());
		//		ВывестиКартинкуМакетаКузова(Выборка.Прицеп2.Модель.МакетКузоваТС, Макет, ТабличныйДокумент);
		//	КонецЕсли;
		//	
		
		//ВыборкаЭлементыПроверки = Выборка.ЭлементыПроверки.Выбрать();
		//Если ВыборкаЭлементыПроверки.Количество() Тогда
			//		ТабличныйДокумент.Вывести(ОбластьШиныШапка);
			//		Пока ВыборкаШины.Следующий() Цикл
			//			ОбластьШины.Параметры.Заполнить(ВыборкаШины);
			//			ТабличныйДокумент.Вывести(ОбластьШины, ВыборкаШины.Уровень());
			//		КонецЦикла;
		//КонецЕсли;
		//	
		//	ВывестиКартинкуМакетаШин(Выборка, Макет, ТабличныйДокумент, Истина);
		//	
		//	ВыборкаАгрегаты = Выборка.Агрегаты.Выбрать();
		//	Если ВыборкаАгрегаты.Количество() Тогда
		//		ТабличныйДокумент.Вывести(ОбластьАгрегатыШапка);
		//		Пока ВыборкаАгрегаты.Следующий() Цикл
		//			ОбластьАгрегаты.Параметры.Заполнить(ВыборкаАгрегаты);
		//			ТабличныйДокумент.Вывести(ОбластьАгрегаты, ВыборкаАгрегаты.Уровень());
		//		КонецЦикла;
		//	КонецЕсли;

		//	ВыборкаКузовныеЭлементы = Выборка.КузовныеЭлементы.Выбрать();
		//	Если ВыборкаКузовныеЭлементы.Количество() Тогда
		//		ТабличныйДокумент.Вывести(ОбластьКузовныеЭлементыШапка);
		//		Пока ВыборкаКузовныеЭлементы.Следующий() Цикл
		//			ОбластьКузовныеЭлементы.Параметры.Заполнить(ВыборкаКузовныеЭлементы);
		//			ТабличныйДокумент.Вывести(ОбластьКузовныеЭлементы, ВыборкаКузовныеЭлементы.Уровень());
		//		КонецЦикла;
		//	КонецЕсли;
		//	
		//	Если уатОбщегоНазначения_проф.ИспользоватьЭлементыКомплектации() Тогда
		//		ВыборкаЭлементыКомплектации = Выборка.ЭлементыКомплектации.Выбрать();
		//		Если ВыборкаЭлементыКомплектации.Количество() Тогда
		//			ТабличныйДокумент.Вывести(ОбластьЭлементыКомплектацииШапка);
		//			Пока ВыборкаЭлементыКомплектации.Следующий() Цикл
		//				ОбластьЭлементыКомплектации.Параметры.Заполнить(ВыборкаЭлементыКомплектации);
		//				ТабличныйДокумент.Вывести(ОбластьЭлементыКомплектации, ВыборкаЭлементыКомплектации.Уровень());
		//			КонецЦикла;
		//		КонецЕсли;
		//	КонецЕсли;
		//	
		//	ТабличныйДокумент.Вывести(ОбластьПодвалПустаяСтрока);
		//	
		//	Если Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПриемОтВодителя
		//		ИЛИ Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаМеждуВодителями
		//		ИЛИ Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПриемОтАрендатора Тогда
		//	    ОбластьПодвалСдал.Параметры.СдалДолжность = уатОбщегоНазначенияТиповые.ПолучитьДолжностьСотрудника(Выборка.Сдал, Выборка.ДатаОсмотра);
		//		ОбластьПодвалСдал.Параметры.СдалПредставление = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(Выборка.Сдал);
		//		ТабличныйДокумент.Вывести(ОбластьПодвалСдал);
		//	КонецЕсли;
		//	Если Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаВодителю
		//		ИЛИ Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаМеждуВодителями
		//		ИЛИ Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаАрендатору Тогда
		//	    ОбластьПодвалПринял.Параметры.ПринялДолжность = уатОбщегоНазначенияТиповые.ПолучитьДолжностьСотрудника(Выборка.Принял, Выборка.ДатаОсмотра);
		//		ОбластьПодвалПринял.Параметры.ПринялПредставление = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(Выборка.Принял);
		//		ТабличныйДокумент.Вывести(ОбластьПодвалПринял);
		//	КонецЕсли;
		//	Если Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.Осмотр
		//		ИЛИ Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПервичныйОсмотр Тогда
		//	    ОбластьПодвалОсмотрПровел.Параметры.ОсмотрПровелДолжность = уатОбщегоНазначенияТиповые.ПолучитьДолжностьСотрудника(Выборка.ОсмотрПровел, Выборка.ДатаОсмотра);
		//		ОбластьПодвалОсмотрПровел.Параметры.ОсмотрПровелПредставление = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(Выборка.ОсмотрПровел);
		//		ТабличныйДокумент.Вывести(ОбластьПодвалОсмотрПровел);
		//	КонецЕсли;
		//	
		//	ВыборкаОтветственныеЛица = Выборка.ОтветственныеЛица.Выбрать();
		//	Если ВыборкаОтветственныеЛица.Количество() > 0 Тогда
		//		ТабличныйДокумент.Вывести(ОбластьПодвалПустаяСтрока);
		//		ТабличныйДокумент.Вывести(ОбластьПодвалШапкаОтветственные);
		//		Пока ВыборкаОтветственныеЛица.Следующий() Цикл
		//			ОбластьПодвалСтрокаОтветственные.Параметры.Заполнить(ВыборкаОтветственныеЛица);
		//			ОбластьПодвалСтрокаОтветственные.Параметры.ФизическоеЛицоПредставление =
		//				уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ВыборкаОтветственныеЛица.ФизическоеЛицо); 
		//			ТабличныйДокумент.Вывести(ОбластьПодвалСтрокаОтветственные, ВыборкаОтветственныеЛица.Уровень());
		//		КонецЦикла;
		//	КонецЕсли;
		//	
		//	ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;

	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция РезультатЗапросаДанныеДокумента(ДокументСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	GDS_АктПриемаПередачиТС.Дата КАК Дата,
	|	GDS_АктПриемаПередачиТС.Номер КАК Номер,
	|	GDS_АктПриемаПередачиТС.ДатаОсмотра КАК ДатаОсмотра,
	|	GDS_АктПриемаПередачиТС.Организация КАК Организация,
	|	GDS_АктПриемаПередачиТС.Одометр КАК Одометр,
	|	GDS_АктПриемаПередачиТС.ОстатокТоплива КАК ОстатокТоплива,
	|	GDS_АктПриемаПередачиТС.Замечания КАК Замечания,
	|	GDS_АктПриемаПередачиТС.ТС КАК ТС,
	|	GDS_АктПриемаПередачиТС.ТС.Модель КАК МодельТС,
	|	GDS_АктПриемаПередачиТС.ТС.ГосударственныйНомер КАК ГосНомер,
	|	GDS_АктПриемаПередачиТС.Сдал КАК Сдал,
	|	GDS_АктПриемаПередачиТС.Принял КАК Принял,
	|	GDS_АктПриемаПередачиТС.ОсмотрПровел КАК ОсмотрПровел,
	|	GDS_АктПриемаПередачиТС.ПУ КАК ПУ,
	|	GDS_АктПриемаПередачиТС.Платон КАК Платон,
	|	GDS_АктПриемаПередачиТС.Подразделение КАК Подразделение,
	|	GDS_АктПриемаПередачиТС.Пробег КАК Пробег,
	|	GDS_АктПриемаПередачиТС.ОдометрТО КАК ОдометрТО,
	|	GDS_АктПриемаПередачиТС.ОдометрПрицеп КАК ОдометрПрицеп,
	|	GDS_АктПриемаПередачиТС.ОдометрПрицепТО КАК ОдометрПрицепТО,
	|	GDS_АктПриемаПередачиТС.ПробегПрицеп КАК ПробегПрицеп,
	|	GDS_АктПриемаПередачиТС.ОстатокТопливаПрицеп КАК ОстатокТопливаПрицеп,
	|	GDS_АктПриемаПередачиТС.ПримечаниеКСостояниюПрицепа КАК ПримечаниеКСостояниюПрицепа,
	|	GDS_АктПриемаПередачиТС.Прицеп.ГосударственныйНомер КАК ГосНомерПрицеп,
	|	GDS_АктПриемаПередачиТС.ЭлементыПроверки.(
	|		НомерСтроки КАК НомерСтроки,
	|		ТС КАК ТС,
	|		ЭлементПроверки КАК ЭлементПроверки,
	|		Состояние КАК Состояние,
	|		Замечания КАК Замечания
	|	) КАК ЭлементыПроверки,
	|	GDS_АктПриемаПередачиТС.СтрокаПринял КАК СтрокаПринял
	|ИЗ
	|	Документ.GDS_АктПриемаПередачиТС КАК GDS_АктПриемаПередачиТС
	|ГДЕ
	|	GDS_АктПриемаПередачиТС.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", ДокументСсылка);
	
	Возврат Запрос.Выполнить();
КонецФункции

Функция ОпределитьФайлыПунктаПроверки(ДокументСсылка, Пункт)
	
	ЕстьФайлы = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	GDS_ФайлыАПП.Имя КАК ИмяФайла
		|ИЗ
		|	РегистрСведений.GDS_ДокументыАПП КАК GDS_ДокументыАПП
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.GDS_ФайлыАПП КАК GDS_ФайлыАПП
		|		ПО GDS_ДокументыАПП.Идентификатор = GDS_ФайлыАПП.Идентификатор
		|ГДЕ
		|	GDS_ДокументыАПП.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИмяФайла = Пункт.Наименование Тогда
			ЕстьФайлы = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьФайлы;
	
КонецФункции

#КонецОбласти

#КонецЕсли
